<script setup>
import { ref } from 'vue'
import ImageModal from '@/components/ImageModal'

const props = defineProps({
  images: {
    type: Array,
    default: () => []
  }
})

const selectedImage = ref(null)
const isModalOpen = ref(false)

const openImageModal = (image) => {
  selectedImage.value = image
  isModalOpen.value = true
}
</script>

<template>
  <div class="special-block-content">
    <div class="special-block-content__text">
      <p>Учебный центр ДПО ООО "Альфа" — это современная обучающая организация, оказывающая качественные образовательные услуги, согласно действующего законодательства РФ, в области обучения охраны труда, пожарной безопасности, электробезопасности, экологии, переподготовки по рабочим специальностям и др.</p>
      <p>Учебный центр ДПО ООО "Альфа" осуществляет образовательную деятельность на основание Лицензии №11594 от 28.09.2020 года.</p>
      <table class="special-block-content__table">
        <tr>
          <th>Формы обучения</th>
          <td>очная, очно-заочная, дистанционная, заочная</td>
        </tr>
        <tr>
          <th>Сроки освоения учебных программ</th>
          <td>от 8 до 256 часов</td>
        </tr>
        <tr>
          <th>Обучение проводится</th>
          <td>на русском языке</td>
        </tr>
        <tr>
          <th>Практика</th>
          <td>проводится на предприятиях Заказчика</td>
        </tr>
        <tr>
          <th>Уровень образования, необходимый для освоения программ</th>
          <td>
            <ul>
              <li>для программ повышения квалификации и профессиональной переподготовки – не ниже средне-специального (технического, профессионального)</li>
              <li>для допусков на право выполнения видов работ – не ниже общего образования</li>
            </ul>
          </td>
        </tr>
      </table>
      <p>Учебный центр ДПО ООО "Альфа":</p>
      <ul>
        <li>в своем штате имеет квалифицированных опытных преподавателей с реальным опытом работы в области охраны труда, пожарной безопасности, электробезопасности и экологии;</li>
        <li>имеет всю необходимую материально-техническую базу в виде учебных помещений, а также оборудование, технические средства обучения для осуществления процесса обучения по охране труда, в том числе медицинские манекены для отработки навыков первой помощи пострадавшим, тренажеры и средства индивидуальной защиты для отработки навыком применения и использования СИЗ;</li>
        <li>проводит групповое обучение в Учебном центре, а также организует индивидуальные выезды преподавателей на территорию Заказчика;</li>
        <li>имеет полигон и тренажеры для отработки навыков обучения безопасным методам и приемам выполнения работ на высоте и в ограниченно-замкнутых пространствах;</li>
        <li>обеспечивает своевременную передачу сведений о лицах, прошедших обучение, в систему Федерального реестра сведений о документах об образовании и (или) о квалификации, документах об обучении;</li>
        <li>обеспечивает своевременную передачу сведений о лицах, обученных требованиям охраны труда (в том числе обучение по оказанию первой помощи пострадавшим и обучение по использованию (применению) средств индивидуальной защиты) в Реестр «обученных по охране труда лиц» в системе единой общероссийской справочно-информационной системе по охране труда.</li>
      </ul>
      <p>По результатам обучения и проверки знаний Ваши сотрудники получат документы установленного образца.</p>
    </div>

    <div v-if="images.length > 0" class="special-block-content__images-wrapper">
      <h3 class="special-block-content__images-title">
        Изображения
      </h3>
      <div class="special-block-content__images">
        <img
          v-for="(image, index) in images"
          :key="index"
          :src="image.src"
          :alt="image.alt"
          class="special-block-content__image"
          @click="openImageModal(image)"
        />
      </div>
    </div>
    <ImageModal
      v-model="isModalOpen"
      :image-src="selectedImage?.src"
      :image-alt="selectedImage?.alt"
    />
  </div>
</template>

<style scoped lang="scss">
@use '../SpecialBlockContent.scss' as *;
</style>
